''' 基本数据类型'''
"""
    整形
            Python3 整型是没有限制大小的
    浮点型
            可以使用科学计数法表示（2.5e2 = 2.5 x 102 = 250）
    复数
            表示：a + bj， 或complex(a, b)
            实部虚部都是浮点类型

    字符串
            可以使用引号( ' 或 " )来创建字符串。
            Python不支持单字符类型，单字符在 Python 中也是作为一个字符串使用。
            字符串格式化
                    类似C的语法
                    例：print ("我叫 %s 今年 %d 岁!" % ('小明', 10))

    list列表
            方括号[]括起来的数据
            第一个元素索引是0
            
    
    tuple元祖
            圆括号()括起来的数据
            下标从0开始
            元祖的元素值不可修改，但是元祖本身可以组合、拆分。
"""
